module.exports = {
	common: {
		tabs: {
			home: 'Старт',
			sup: 'Что нового',
			graphs: 'Графики',
			math: 'Математические Инструменты',
			music: 'Музыка',
			other: 'Другие',
		},
		see_also: {
			title: 'Смотрите также',
			youtube: {
				title: 'Канал YouTube',
				summary: 'На моём канале YT, я когда-то вставлял мои старые графики. Теперь я рассматриваю вставить туда музыку.',
			},
			discord: {
				title: 'Сервер Discord',
				summary: 'Вступайте в маленькую сообщество Угола Гноуна! Тусовайтесь и говорите о математике, музыке, смотри какие-то мемы и больше.',
			},
			beetmacol: {
				title: 'Сайт BeetMacol',
				summary: 'BeetMacol – мой брат и хороший программист, который иногда помогал мне сделать этот сайт.',
			},
			kubagliko: {
				title: 'Сайт Kubagliko_PL',
				summary: 'Мой друг и ещё один хороший программист.',
			},
			github: {
				title: 'Хранилище этого сайта на GitHub',
				summary: 'Код, которого не хотите увидеть.',
			},
		},
		settings: {
			title: 'Настройки',
			languages: {
				title: 'Выбор языка'
			},
			soontm: 'Больше настроек вскоре...',
		},
	},
	other: {
		backto: 'Возврат в',
		other: 'Другие',
		otter: 'Другие',
	},
	sc: {
		enter: 'Введите верный пароль',
		check: 'Проверить',
		tooshort: 'Пароль слишком короткий.',
		loading: 'Загрузание...',
		processing: 'Процессирование...',
		incorrect: 'Неверный пароль. Пожалуйста попытайтесь снова.',
	},
	error: {
		error: 'Ошибка 404',
		oops: 'Ой',
		desc1: 'Кажется, что вы пытались доступить несуществующую страницу. Можете нажмить на одную из закладок выше или ',
		desc2: ' чтобы возвратиться в сайт... Или может быть ',
		desc3: 'Я не уверен. Надеюсь, что вы найдете путь назад!',
		here: 'здесь',
		scinfo: '... Вы искали Секретной Комнаты? Если так, искайте далее! Может быть, что вы одни, кто её найдёт.',
	},
	math: {
		table: {
			title: 'Оглавление',
			group1: 'Числа вообще',
			tool1a: 'Упроститель Дробей',
			tool1b: 'Наибольший Общий Делитель',
			tool1c: 'Наименьшее Общее Кратное',
			tool1d: 'Конвертер Градусов в Радияны',
			tool1e: 'Конвертер Радианов в Градусы',
			group2: 'Аналитическая Геометрия',
			group2A: 'Векторы',
			tool2Aa: 'Длина Вектора',
			tool2Ab: 'Конвертер Декартовой формы в Полярную',
			tool2Ac: 'Конвертер Полярной формы в Декартовую',
			group2B: 'Другое',
			tool2Ba: 'Расстояние Между Точками',
			tool2Bb: 'Середина Отрезка',
			tool2Bc: 'Расстояние Между Прямыми',
			tool2Bd: 'Расстояние Между Прямой и Точкой',
			group3: 'Комплексные Числа',
			tool3a: 'Комплексное Деление (алгебраическая форма)',
			tool3b: 'Комплексное Деление (тригонометрическая форма)',
			tool3c: 'Конвертер Алгебраической формы в Тригонометрической',
			tool3d: 'Конвертер Тригонометрической формы в Аглебраической',
			ext: 'Внешние ссылки',
		},
		ns: {
			binary: 'Binary',
			octal: 'Octal',
			decimal: 'Decimal',
			hexadecimal: 'Hexadecimal',
			rgb: 'RGB',
		},
		frac: { 
			input: 'Дробь до упрощения',
			com1: '(здесь введите числитель)',
			com2: '(здесь введите знаменатель)',
			output: 'Упрощенная дробь',
			outcom: 'Если вы получили тот же самый результат, это значит что дробь не может быть упрощенным.',
		},
		gcf: {
			input1: 'Число #1',
			input2: 'Число #2',
			output: 'НОД',
		},
		lcm: {
			input1: 'Число #1',
			input2: 'Число #2',
			output: 'НОК',
		},
		degtorad: {
			input: 'Значение в градусах',
			output: 'Значение в радианах',
		},
		magnitude: {
			input: 'Коордынаты вектора',
			output: 'Длина',
		},
		vctp: {
			input: 'Декартовая форма',
			output: 'Полярная форма',
		},
		dbp: {
			input1: 'Точка 1',
			input2: 'Точка 2',
			output: 'Расстояние',
		},
		midpt: {
			output: 'Середина Отрезка',
		},
		dbl: {
			input1: 'Для уравнений с угловым коэффициентом',
			input2: 'Для общих уравнений',
			input2a: 'Прямая',
		},
		result: 'Результат',
		common: {
			expl: 'Объяснение',
			more: 'Читать далее',
			also: 'Смотрите также',
			return: 'Возврат наверх',
		}
	},
}